In [1]:
%load_ext sql
%sql sqlite:///

'Connected: @'

In [3]:
%%sql
CREATE TABLE T(
    A varchar(255),
    B varchar(255),
    C varchar(255)
);

 * sqlite:///
Done.

[]

In [4]:
%%sql
INSERT INTO T
VALUES(1,2,3);

 * sqlite:///
1 rows affected.

[]

In [9]:
%%sql
INSERT INTO T
VALUES(1,3,2);

 * sqlite:///
1 rows affected.

[]

In [10]:
%%sql
SELECT *
FROM T;

 * sqlite:///
Done.

[('1', '2', '3'), ('1', '3', '2'), ('1', '3', '2')]

In [7]:
%%sql
SELECT DISTINCT A,B,C
FROM T;

 * sqlite:///
Done.

[('1', '2', '3'), ('1', '3', '2')]

In [8]:
%%sql
SELECT DISTINCT A
FROM T;

 * sqlite:///
Done.

[('1',)]